8evgeny/GIT/7_Camera/Project_Keil_Camera/SPL/MDR32F2C10/inc/MDR32F2C10_dma.h
/**
  ******************************************************************************
  * @file    MDR32F2C10_dma.h
  * @author  Milandr Application Team
  * @version V1.0.1
  * @date    11/11/2020
  * @brief   This file contains all the functions prototypes for the DMA
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2021 Milandr</center></h2>
  ******************************************************************************
  * FILE MDR32F2C10_dma.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F2C10_DMA_H
#define __MDR32F2C10_DMA_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32F2C10_config.h"	

/** @addtogroup __MDR32F2C10_StdPeriph_Driver MDR32F2C10 Standard Peripherial Driver
  * @{
  */

/** @addtogroup DMA DMA
  * @{
  */

/** @defgroup DMA_Exported_Types DMA Exported Types
  * @{
  */

/**
  * @brief  DMA Channel Primary / Alternate Control Data initialization structure definition
  */

typedef struct
{
  uint32_t DMA_SourceBaseAddr;                                                          /*!< Specifies the source base address for DMA Channelx. */
                                                                                        
  uint32_t DMA_DestBaseAddr;                                                            /*!< Specifies the destination base address for DMA Channelx. */
                                                                                        
  uint32_t DMA_SourceIncSize;                                                           /*!< Specifies the source address register increment value.
                                                                                          This parameter can be a value of @ref DMA_source_incremented_mode */
                                                                                        
  uint32_t DMA_DestIncSize;                                                             /*!< Specifies the destination address register increment value.
                                                                                          This parameter can be a value of @ref DMA_dest_incremented_mode */
                                                                                        
  uint32_t DMA_MemoryDataSize;                                                          /*!< Specifies the Memory data width.
                                                                                          This parameter can be a value of @ref DMA_memory_data_size */
                                                                                        
  uint32_t DMA_Mode;                                                                    /*!< Specifies the operation mode of the DMA Channelx.
                                                                                          This parameter can be a value of @ref DMA_operating_mode. */
                                                                                        
  uint32_t DMA_CycleSize;                                                               /*!< Specifies the  total number of DMA transfers that the DMA cycle contains.
                                                                                          This parameter can be a value of @ref DMA_cycle_size. */
                                                                                        
  uint32_t DMA_NumContinuous;                                                           /*!< Specifies how many DMA transfers can occur before the DMA controller rearbitrates.
                                                                                          This parameter can be a value of @ref DMA_number_continuous_transfers. */
                                                                                        
  uint32_t DMA_SourceProtCtrl;                                                          /*!< Specifies the DMA Source protection control.
                                                                                          This parameter can be a value of @ref DMA_source_protection_control. */
                                                                                        
  uint32_t DMA_DestProtCtrl;                                                            /*!< Specifies the DMA Destination protection control.
                                                                                          This parameter can be a value of @ref DMA_dest_protection_control. */
} DMA_CtrlDataInitTypeDef;

/**
  * @brief  DMA Channel Control Data structure definition
  */

typedef struct
{
  uint32_t DMA_SourceEndAddr;                                                           /*!< Specifies the DMA channel source end address */
                                            
  uint32_t DMA_DestEndAddr;                                                             /*!< Specifies the DMA channel destination end address. */
                                            
  uint32_t DMA_Control;                                                                 /*!< Specifies the DMA channel control data configuration. */
                                            
  uint32_t DMA_Unused;                                                                  /*!< Specifies the DMA channel unused memory. */
                                            
